Tekla Open API Reference for Tekla Structures 2025
WpfProfileCatalog Constructor
Overload List
Name | Description
WpfProfileCatalog()
 Initiates a new instance of the control.
WpfProfileCatalog(String)
 Initiates a new instance of the control selecting the given profile.
Top
See Also
Reference
WpfProfileCatalog Class
Tekla.Structures.Dialog.UIControls Namespace